{
    "extract_embedding": {
        "page_name": "RNA Sequence Embedding Extraction",
        "href": "/extract_embedding",
        "fig": "/assets/embedding.jpg",
        "description": "Extract high-dimensional embeddings from RNA sequences using the Uni-RNA pre-training model. These embeddings capture rich semantic information about RNA sequences and can be used for downstream analysis and machine learning tasks."
    },
    "rna_ss": {
        "page_name": "RNA Secondary Structure Prediction",
        "href": "/rna_ss",
        "fig": "/assets/RNA二级结构.png",
        "description": "Accelerate your scientific research with RNA secondary structure prediction tools based on the Uni-RNA pre-training model. We have trained our model on various datasets, including our Uni-RNA datasets and the RNAStralign dataset for your selection and evaluation."
    },
    "utr": {
        "page_name": "5' UTR Mean Ribosomal Load Prediction",
        "href": "/utr",
        "fig": "/assets/5UTR.jpg",
        "description": "Use the Uni-RNA pre-training model to predict the mean ribosomal loading of mRNA's 5'UTR, aiding in obtaining functionally superior mRNA for scientific research and pharmaceutical development."
    },
    "apa": {
        "page_name": "Alternative Polyadenylation Prediction",
        "href": "/apa",
        "fig": "/assets/3UTR.jpg",
        "description": "Predict alternative polyadenylation (APA) sites in RNA sequences using the Uni-RNA pre-training model. APA is a crucial post-transcriptional regulation mechanism that affects mRNA stability, localization, and translation efficiency."
    },
    "m6a": {
        "page_name": "m6A Modification Prediction",
        "href": "/m6a",
        "fig": "/assets/m6A.png",
        "description": "Use the Uni-RNA pre-training model to identify potential methylation modification sites, enhancing your research into RNA functions in the presence of extensive modifications."
    },
    "lncrna_sublocalization": {
        "page_name": "lncRNA Subcellular Localization Prediction",
        "href": "/lncrna_sublocalization",
        "fig": "/assets/lncRNA.jpg",
        "description": "Long non-coding RNAs (lncRNAs) play a crucial role in the regulatory network of RNA functions. Using the Uni-RNA pre-training model, we efficiently and accurately predict the potential localization of lncRNAs within cells and extract important motifs through the model's attention scores."
    }
}